tutorials/heatTransfer/buoyantSimpleFoam/comfortHotRoom/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0 0 1.6)
    (0 3 1.6)
    (0 3 0)

    (4 0 0)
    (4 0 1.6)
    (4 3 1.6)
    (4 3 0)
);

blocks
(
    hex (0 3 2 1 4 7 6 5)
    (40 20 60)
    simpleGrading (1 1 1)
);

defaultPatch
{
    name walls;
    type wall;
}

boundary
();


// ************************************************************************* //
